In [3]:
import pandas as pd
df = pd.read_csv("C:\\Users\\SHREE\\Desktop\\Z-data_samples\\facalty.csv")
print(df)

    ID     Name  Age     City  Experience
0   11     Jack   44   Sydney          19
1   12     Riti   41    Delhi          17
2   13     Aadi   46   Mumbai          11
3   14    Mohit   45    Delhi          15
4   15    Veena   43    Delhi          14
5   16  Shaunak   42   Mumbai          17
6   17    Manik   42   Sydney          14
7   18    Vikas   42    Delhi          11
8   19    Samir   42   Mumbai          15
9   20  Shobhit   40   Sydney          12

In [4]:
city = df.groupby("City")
print(city)
print(type(city))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002C859F164B0>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [ ]:
# Get the Group Name and Its Details
for grp_name,grp_rec in city:
    print("*"*50)
    print("Group Name :", grp_name)
    print("*"*50)
    print(grp_rec)
    print("*"*50)

In [14]:
print(df)

    ID     Name  Age     City  Experience
0   11     Jack   44   Sydney          19
1   12     Riti   41    Delhi          17
2   13     Aadi   46   Mumbai          11
3   14    Mohit   45    Delhi          15
4   15    Veena   43    Delhi          14
5   16  Shaunak   42   Mumbai          17
6   17    Manik   42   Sydney          14
7   18    Vikas   42    Delhi          11
8   19    Samir   42   Mumbai          15
9   20  Shobhit   40   Sydney          12

In [17]:
age = df.groupby("Age")
for age,rec in age:
    print('--------------------------------')
    print("Age group is =", age)
    print('---------------------------------')
    print(rec)

--------------------------------
Age group is = 40
---------------------------------
    ID     Name  Age    City  Experience
9   20  Shobhit   40  Sydney          12
--------------------------------
Age group is = 41
---------------------------------
    ID  Name  Age    City  Experience
1   12  Riti   41   Delhi          17
--------------------------------
Age group is = 42
---------------------------------
    ID     Name  Age     City  Experience
5   16  Shaunak   42   Mumbai          17
6   17    Manik   42   Sydney          14
7   18    Vikas   42    Delhi          11
8   19    Samir   42   Mumbai          15
--------------------------------
Age group is = 43
---------------------------------
    ID   Name  Age   City  Experience
4   15  Veena   43  Delhi          14
--------------------------------
Age group is = 44
---------------------------------
    ID   Name  Age     City  Experience
0   11   Jack   44   Sydney          19
--------------------------------
Age group is = 45
---------------------------------
    ID   Name  Age   City  Experience
3   14  Mohit   45  Delhi          15
--------------------------------
Age group is = 46
---------------------------------
    ID  Name  Age    City  Experience
2   13  Aadi   46  Mumbai          11

In [22]:
df.groupby('City').nunique()

          ID  Name  Age  Experience
City
 Delhi     1     1    1           1
 Mumbai    1     1    1           1
 Sydney    1     1    1           1
Delhi      3     3    3           3
Mumbai     2     2    2           2
Sydney     2     2    2           2

In [23]:
# get the First Record Every Group
city.first()

          ID     Name  Age  Experience
City
 Delhi    12     Riti   41          17
 Mumbai   16  Shaunak   42          17
 Sydney   11     Jack   44          19
Delhi     14    Mohit   45          15
Mumbai    13     Aadi   46          11
Sydney    17    Manik   42          14

In [24]:
# get the last Record Every Group
city.last()

          ID     Name  Age  Experience
City
 Delhi    12     Riti   41          17
 Mumbai   16  Shaunak   42          17
 Sydney   11     Jack   44          19
Delhi     18    Vikas   42          11
Mumbai    19    Samir   42          15
Sydney    20  Shobhit   40          12

In [31]:
# get the Third Record Every Group
city.nth(1)

    ID     Name  Age    City  Experience
4   15    Veena   43   Delhi          14
8   19    Samir   42  Mumbai          15
9   20  Shobhit   40  Sydney          12

In [32]:
for name,rec in city:
    print('--------------------------')
    print("Group name =", name)
    print('---------------------------')
    print(rec)

--------------------------
Group name =  Delhi
---------------------------
    ID  Name  Age    City  Experience
1   12  Riti   41   Delhi          17
--------------------------
Group name =  Mumbai
---------------------------
    ID     Name  Age     City  Experience
5   16  Shaunak   42   Mumbai          17
--------------------------
Group name =  Sydney
---------------------------
    ID   Name  Age     City  Experience
0   11   Jack   44   Sydney          19
--------------------------
Group name = Delhi
---------------------------
    ID   Name  Age   City  Experience
3   14  Mohit   45  Delhi          15
4   15  Veena   43  Delhi          14
7   18  Vikas   42  Delhi          11
--------------------------
Group name = Mumbai
---------------------------
    ID   Name  Age    City  Experience
2   13   Aadi   46  Mumbai          11
8   19  Samir   42  Mumbai          15
--------------------------
Group name = Sydney
---------------------------
    ID     Name  Age    City  Experience
6   17    Manik   42  Sydney          14
9   20  Shobhit   40  Sydney          12

In [41]:
agg = df.groupby("Age")
for ag,rec in agg:
    print('--------------------------')
    print("Age Group is =", ag)
    print('---------------------------')
    print(rec)

--------------------------
Age Group is = 40
---------------------------
    ID     Name  Age    City  Experience
9   20  Shobhit   40  Sydney          12
--------------------------
Age Group is = 41
---------------------------
    ID  Name  Age    City  Experience
1   12  Riti   41   Delhi          17
--------------------------
Age Group is = 42
---------------------------
    ID     Name  Age     City  Experience
5   16  Shaunak   42   Mumbai          17
6   17    Manik   42   Sydney          14
7   18    Vikas   42    Delhi          11
8   19    Samir   42   Mumbai          15
--------------------------
Age Group is = 43
---------------------------
    ID   Name  Age   City  Experience
4   15  Veena   43  Delhi          14
--------------------------
Age Group is = 44
---------------------------
    ID   Name  Age     City  Experience
0   11   Jack   44   Sydney          19
--------------------------
Age Group is = 45
---------------------------
    ID   Name  Age   City  Experience
3   14  Mohit   45  Delhi          15
--------------------------
Age Group is = 46
---------------------------
    ID  Name  Age    City  Experience
2   13  Aadi   46  Mumbai          11

In [42]:
agg.first()

      ID     Name     City  Experience
Age
40    20  Shobhit   Sydney          12
41    12     Riti    Delhi          17
42    16  Shaunak   Mumbai          17
43    15    Veena    Delhi          14
44    11     Jack   Sydney          19
45    14    Mohit    Delhi          15
46    13     Aadi   Mumbai          11

In [43]:
agg.last()

      ID     Name     City  Experience
Age
40    20  Shobhit   Sydney          12
41    12     Riti    Delhi          17
42    19    Samir   Mumbai          15
43    15    Veena    Delhi          14
44    11     Jack   Sydney          19
45    14    Mohit    Delhi          15
46    13     Aadi   Mumbai          11

In [52]:
agg.nth(2)

    ID   Name  Age   City  Experience
7   18  Vikas   42  Delhi          11

In [5]:
# get the size of dataframe groups
city.size()

City
 Delhi     1
 Mumbai    1
 Sydney    1
Delhi      3
Mumbai     2
Sydney     2
dtype: int64

In [54]:
agg.size()

Age
40    1
41    1
42    4
43    1
44    1
45    1
46    1
dtype: int64

In [55]:
gby = df.groupby("City")
for groupinfo in gby:
    print(type(groupinfo))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [59]:
gby = df.groupby("City")
for groupinfo in gby:
    print(groupinfo[0])

 Delhi
 Mumbai
 Sydney
Delhi
Mumbai
Sydney

In [62]:
# get the name and size of group
for gro in gby:
    print("{} --> {}".format(gro[0],len(gro[1])))

 Delhi --> 1
 Mumbai --> 1
 Sydney --> 1
Delhi --> 3
Mumbai --> 2
Sydney --> 2

In [63]:
for ty in gby:
    print(type(ty[1]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [64]:
values = df.groupby('City').agg( {'Age': 'mean', 'Experience': 'sum'})
print(values)

               Age  Experience
City
 Delhi   41.000000          17
 Mumbai  42.000000          17
 Sydney  44.000000          19
Delhi    43.333333          40
Mumbai   44.000000          26
Sydney   41.000000          26

In [65]:
# Get the size, sum and mean of values
# of each numeric column in each group
values = df.groupby('City')["Age"].agg(['size', 'sum', 'mean'])
print(values)

         size  sum       mean
City
 Delhi      1   41  41.000000
 Mumbai     1   42  42.000000
 Sydney     1   44  44.000000
Delhi       3  130  43.333333
Mumbai      2   88  44.000000
Sydney      2   82  41.000000